{
  "backend/main.mo": "Actor providing user profile management with access control and a public contact form system storing timestamped submissions.",
  "feature_evidence.json": "Feature evidence record linking a landing page text update to the specific frontend file affected.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and styling of key frontend landing page components and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color tokens and global background/foreground styles including dark mode variants.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Renders the LandingPage component as the sole view.",
  "frontend/src/components/landing/ContactForm.tsx": "Interactive contact form component handling validation, submission, and success UI with React state and custom hook.",
  "frontend/src/components/landing/ContactSection.tsx": "Landing page contact section with location/info cards and embedded ContactForm.",
  "frontend/src/components/landing/Footer.tsx": "Footer with social links, branding, overlays, and external references including WhatsApp and Twitter.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section displaying the main title, tagline, updated banter phrasing, and CTA buttons with strong visual emphasis.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the landing page layout with a background image and sections like hero, offers, reviews, contact, and footer.",
  "frontend/src/components/landing/OffersSection.tsx": "Displays a grid of tour feature cards with icons, titles, and descriptions under a themed section header.",
  "frontend/src/components/landing/ReviewCard.tsx": "Renders an individual review card with star rating, review text, and reviewer name.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Shows a reviews section that maps curated reviews into ReviewCards and includes a TripAdvisor call‑to‑action.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled external link button directing users to the TripAdvisor review page.",
  "frontend/src/content/curatedReviews.ts": "Exports a list of predefined customer reviews with IDs, ratings, reviewers, and excerpts.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling identity loading, login flow, and state exposure to components.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a mutation hook that submits contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Configures Tailwind layers, color variables, typography, and utility classes including text shadows and theme settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors, animations, and custom theme settings.",
  "project_state.json": "Stores project state metadata, feature info, and a pending request to update hero copy text."
}