{
  "backend/main.mo": "Motoko canister implementing user profiles, RBAC-based access control, and contact form submission storage with admin-only retrieval.",
  "feature_evidence.json": "Feature evidence report listing required frontend well-known files, asset configuration, and related components and tests.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend source files and components.",
  "frontend/.env.production.example": "Example production environment variables for build metadata used by the frontend’s build indicator.",
  "frontend/index.css": "Tailwind-driven global styles defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and preloading the critical hero background image.",
  "frontend/PRODUCTION_CONFIGURATION.md": "Documentation describing production admin access, RBAC flow, and contact form spam protection.",
  "frontend/PRODUCTION_DEPLOYMENT_NOTES.md": "Guide outlining production deployment steps and draft vs live behavior.",
  "frontend/public/.ic-assets.json": "Asset configuration declaring content types and zero-cache settings for two well-known static files.",
  "frontend/public/.well-known/ic-domains": "Two-line domain list for IC domain verification.",
  "frontend/public/.well-known/ii-alternative-origins": "Static JSON defining alternative origins for Internet Identity.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Smoke test checklist for validating production deployment, including landing page, offers, and contact form.",
  "frontend/src/App.tsx": "Defines the app's root layout and TanStack Router routes, using lazy-loaded pages with Suspense loaders and multiple admin route aliases.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Renders an admin access screen handling Internet Identity login/logout and showing different UI for unauthenticated or unauthorized users.",
  "frontend/src/components/diagnostics/BuildEnvironmentIndicator.tsx": "Displays host, build mode, and build metadata with safe fallbacks and logs environment details to the console.",
  "frontend/src/components/landing/ContactForm.tsx": "Implements a validated contact form with bot-detection timing, honeypot, submission handling, and success state UI.",
  "frontend/src/components/landing/ContactSection.tsx": "Wraps the contact page layout, showing contact methods and embedding the ContactForm component.",
  "frontend/src/components/landing/Footer.tsx": "Shows footer links and social icons and embeds the build environment indicator.",
  "frontend/src/components/landing/HeroSection.tsx": "Displays the main hero banner with tagline, CTA buttons, and scroll indicator.",
  "frontend/src/components/landing/LandingPage.tsx": "Assembles the main landing page, layering a background image behind hero, offers, reviews, contact, and footer sections.",
  "frontend/src/components/landing/OffersSection.tsx": "Renders a feature grid highlighting tour selling points with links to offer pages.",
  "frontend/src/components/landing/ReviewCard.tsx": "Displays a single review with star rating, excerpt, and reviewer info.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Shows a grid of curated reviews and a TripAdvisor call-to-action button.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled external link button to the TripAdvisor reviews page.",
  "frontend/src/components/offers/GetInTouchCtaLink.tsx": "CTA link that routes to the homepage and scrolls to the contact section.",
  "frontend/src/content/countryCallingCodes.ts": "Exports a list of country calling code options with labels and metadata.",
  "frontend/src/content/curatedReviews.ts": "Defines and exports a list of curated 5‑star customer reviews.",
  "frontend/src/content/offersPosts.ts": "Exports structured content for offer-detail pages, including sections and metadata.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance, refreshing on identity changes.",
  "frontend/src/hooks/useAdminBootstrapAccess.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useAdminContactSubmissions.ts": "Fetches all contact submissions with admin authorization handling.",
  "frontend/src/hooks/useAdminPasswordLogin.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs a one-time backend connectivity and deployment info check using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks whether the authenticated user is an admin using a backend actor and react-query.",
  "frontend/src/hooks/usePageSeo.ts": "Updates document title, meta tags, Open Graph, Twitter card tags, and optional JSON‑LD based on page-specific SEO config.",
  "frontend/src/hooks/useRecaptchaV3.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useScrollToHashSection.ts": "Scrolls smoothly to the DOM element matching the current URL hash on mount and hash changes.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Handles submitting the contact form via the backend actor with error parsing and cache invalidation.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, color variables, typography, and utility classes for styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminEntryPage.tsx": "Determines admin access, showing loading, access denied, or the submissions admin page based on identity and admin status.",
  "frontend/src/pages/admin/ContactSubmissionsAdminPage.tsx": "Displays and manages contact form submissions with backend health diagnostics, admin access checks, and logout functionality.",
  "frontend/src/pages/diagnostics/DraftVsLiveDiagnosticsPage.tsx": "Diagnostics page showing frontend env data, backend health, and canister info to compare draft vs live deployments.",
  "frontend/src/pages/offers/ChooseYourOwnAdventurePage.tsx": "Renders the Choose Your Own Adventure offer article with SEO, content sections, and a contact CTA.",
  "frontend/src/pages/offers/FlexibleAsHellPage.tsx": "Renders the Flexible As Hell offer article with SEO metadata, structured sections, and a contact CTA.",
  "frontend/src/pages/offers/OffTheBeatenPathPage.tsx": "Renders the Off The Beaten Path offer article with SEO, content sections, and a contact CTA.",
  "frontend/src/pages/offers/PrivateAndPersonalPage.tsx": "Renders the Private and Personal offer article including SEO setup, article body, and a contact CTA.",
  "frontend/src/pages/offers/StayYourWayPage.tsx": "Renders the Stay Your Way offer article with SEO configuration, detailed sections, and a CTA link.",
  "frontend/src/pages/offers/StoriesAndBanterPage.tsx": "Renders the Stories and Banter offer article featuring SEO data, multiple content sections, and a CTA.",
  "frontend/src/types/recaptcha.d.ts": "Placeholder TypeScript declaration file for reCAPTCHA types.",
  "frontend/src/utils/formatTimestamp.ts": "Converts a bigint nanosecond timestamp to a formatted US locale date-time string.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, and plugin integrations for the frontend.",
  "project_state.json": "Tracks project state and requirements for configuring ICP custom domain verification and related static assets."
}