{
  "backend/main.mo": "Main backend actor handling user profiles, access control, and contact form submissions including new phone fields.",
  "backend/migration.mo": "Migration module converting old contact submissions to include default phone fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files.",
  "frontend/index.css": "Base Tailwind and custom OKLCH color variable definitions for global styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React component rendering the LandingPage.",
  "frontend/src/components/landing/ContactForm.tsx": "Contact form with validation and submission of name, email, phone country code, phone number, subject, and message.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact section layout with location info, email card, and embedded ContactForm.",
  "frontend/src/components/landing/Footer.tsx": "Renders the site footer with branding and email, Twitter, and WhatsApp contact links.",
  "frontend/src/components/landing/HeroSection.tsx": "Displays the hero banner with main branding, tagline, call‑to‑action buttons, and scroll indicator.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the full landing page with background image and stacked sections including hero, offers, reviews, contact, and footer.",
  "frontend/src/components/landing/OffersSection.tsx": "Shows a grid of tour feature cards describing key offerings with icons and animated styling.",
  "frontend/src/components/landing/ReviewCard.tsx": "Displays a single review with star rating, excerpt, and reviewer name.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Renders the reviews section using curated reviews and includes a TripAdvisor CTA.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled link button directing users to the TripAdvisor review page.",
  "frontend/src/content/countryCallingCodes.ts": "Exports a list of country calling codes for use in phone number selection.",
  "frontend/src/content/curatedReviews.ts": "Provides a static array of curated 5‑star review objects.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Defines a mutation hook to submit contact form data through the backend actor and invalidate related queries.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables for light/dark themes, typography defaults, and utility text-shadow classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Captures project state, including implemented features and pending requests related to adding phone number fields to a contact form."
}