{
  "backend/main.mo": "Backend canister defining user profiles, access control, contact form submission handling, junk filtering, and reCAPTCHA configuration fields.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs for production deployment and verification.",
  "frontend-file-summaries.txt": "List of summarized frontend files describing component behaviors, styles, routing, and contact form logic.",
  "frontend/.env.production.example": "Example production environment file showing how to set the public reCAPTCHA site key.",
  "frontend/index.css": "Global Tailwind-based styling defining OKLCH color variables and dark mode adjustments.",
  "frontend/index.html": "HTML entry file preloading the hero image and setting up DNS prefetch plus the root mount point.",
  "frontend/PRODUCTION_CONFIGURATION.md": "Documentation for configuring frontend and backend reCAPTCHA settings and required post-deployment admin steps.",
  "frontend/PRODUCTION_DEPLOYMENT_NOTES.md": "Stub document outlining production deployment notes for Version 33.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Checklist for verifying landing page, lazy-loaded routes, contact form behavior, and access control after deployment.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for the landing page and lazily loaded offer pages, providing a router provider wrapper.",
  "frontend/src/components/landing/ContactForm.tsx": "Implements a contact form with validation, reCAPTCHA v3 handling, bot checks, and form submission via a custom hook.",
  "frontend/src/components/landing/ContactSection.tsx": "Displays the contact section with location info, email details, and initializes the contact form once the section becomes visible.",
  "frontend/src/components/landing/Footer.tsx": "Renders the site footer with branding, social media links, and a humorous site credit message.",
  "frontend/src/components/landing/HeroSection.tsx": "Defines the hero section with large branding text, descriptive messaging, and call‑to‑action buttons.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the full landing page layout including hero, offers, reviews, contact, and footer sections over a fixed background image.",
  "frontend/src/components/landing/OffersSection.tsx": "Shows a grid of tour feature cards that link to detailed offer pages using TanStack Router.",
  "frontend/src/components/landing/ReviewCard.tsx": "Displays an individual review with star rating, excerpt, and reviewer name.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Renders the reviews section with a grid of curated reviews and a TripAdvisor call‑to‑action.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Button linking to a TripAdvisor review page with animated icon styling.",
  "frontend/src/components/offers/GetInTouchCtaLink.tsx": "CTA link sending users to the home page’s contact section via hash navigation.",
  "frontend/src/content/countryCallingCodes.ts": "Empty content file with no exports.",
  "frontend/src/content/curatedReviews.ts": "Defines a CuratedReview interface and exports an array of preset customer review objects.",
  "frontend/src/content/offersPosts.ts": "Defines OfferPost structure and exports detailed offer content, including long-form sections for tour packages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and status tracking.",
  "frontend/src/hooks/usePageSeo.ts": "Updates document title, meta tags, Open Graph data, and optional article JSON-LD based on provided SEO config.",
  "frontend/src/hooks/useRecaptchaV3.ts": "Loads and initializes reCAPTCHA v3 on demand and exposes a method to execute actions for tokens.",
  "frontend/src/hooks/useScrollToHashSection.ts": "Scrolls smoothly to the element matching the current URL hash on mount or hash changes.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Submits contact form data via the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for light/dark themes, base typography, and custom text-shadow utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/src/pages/offers/ChooseYourOwnAdventurePage.tsx": "Renders the Choose Your Own Adventure offer page with SEO setup, styled layout, dynamic post content, and a CTA.",
  "frontend/src/pages/offers/FlexibleAsHellPage.tsx": "Renders the Flexible as Hell offer page using shared styling, SEO config, dynamic post content, and a CTA.",
  "frontend/src/pages/offers/OffTheBeatenPathPage.tsx": "Renders the Off the Beaten Path offer page with SEO metadata, post-driven sections, and CTA component.",
  "frontend/src/pages/offers/PrivateAndPersonalPage.tsx": "Renders the Private and Personal offer page with themed layout, SEO settings, and mapped post content.",
  "frontend/src/pages/offers/StayYourWayPage.tsx": "Renders the Stay Your Way offer page using shared offer-page structure, SEO config, and CTA.",
  "frontend/src/pages/offers/StoriesAndBanterPage.tsx": "Renders the Stories and Banter offer page with SEO data, dynamic content sections, and a CTA.",
  "frontend/src/types/recaptcha.d.ts": "Declares global TypeScript definitions for window.grecaptcha with ready and execute methods.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params (including hash routing) and storing, retrieving, or clearing them in sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s deployment state, existing features, and new feature requests for preparing Version 33 for production."
}