{
  "backend/main.mo": "Implements user profile management, role-based access control, and contact form submission with admin‑restricted retrieval and spam checks.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend source files and components.",
  "frontend/.env.production.example": "Example production environment variable file showing optional build metadata settings.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH‑based color variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry file loading the React app and preloading the hero background image.",
  "frontend/PRODUCTION_CONFIGURATION.md": "Describes production configuration covering admin access, RBAC behavior, contact form spam protection, and security notes.",
  "frontend/PRODUCTION_DEPLOYMENT_NOTES.md": "Provides deployment instructions and explains draft vs live environments for production builds.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Outlines post‑deployment smoke tests for landing page, offers, and contact form functionality in production.",
  "frontend/src/App.tsx": "Sets up the root layout, lazy‑loaded offer/admin routes, and routing structure using TanStack Router with a global backend health check.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Displays login or access‑denied messaging for admin users, handling Internet Identity authentication and logout.",
  "frontend/src/components/diagnostics/BuildEnvironmentIndicator.tsx": "Shows build metadata such as host, mode, version, and timestamp with console logging for diagnostics.",
  "frontend/src/components/landing/ContactForm.tsx": "Implements a validated contact form with bot‑detection timing logic and submission via a custom mutation hook.",
  "frontend/src/components/landing/ContactSection.tsx": "Renders the contact area with contact options and the contact form integrated into a two‑column layout.",
  "frontend/src/components/landing/Footer.tsx": "Shows site footer with social links, contact shortcuts, and the build environment indicator.",
  "frontend/src/components/landing/HeroSection.tsx": "Defines the hero banner with main branding, intro text, and call‑to‑action buttons.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the homepage layout with background imagery and all main sections including hero, offers, reviews, contact, and footer.",
  "frontend/src/components/landing/OffersSection.tsx": "Renders a landing-page section listing feature cards that link to individual offer pages with icons, titles, and descriptions.",
  "frontend/src/components/landing/ReviewCard.tsx": "Displays an individual review with star rating, excerpt, and reviewer name in a styled card.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Shows a reviews section containing multiple curated review cards and a TripAdvisor CTA button.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled external link button directing users to the TripAdvisor review page.",
  "frontend/src/components/offers/GetInTouchCtaLink.tsx": "Reusable CTA link that routes to the home page and scrolls to the contact section via hash navigation.",
  "frontend/src/content/countryCallingCodes.ts": "Exports a list of country calling code options including values, abbreviations, and labels.",
  "frontend/src/content/curatedReviews.ts": "Defines and exports an array of hardcoded customer reviews used for the reviews section.",
  "frontend/src/content/offersPosts.ts": "Provides structured content data for offer detail pages, including metadata and multi-section text.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor, refreshing it on identity changes and invalidating related queries.",
  "frontend/src/hooks/useAdminBootstrapAccess.ts": "Empty file placeholder for admin bootstrap access logic.",
  "frontend/src/hooks/useAdminContactSubmissions.ts": "Hook to fetch all contact submissions via the actor with error handling for authorization failures.",
  "frontend/src/hooks/useAdminPasswordLogin.ts": "Empty file placeholder for admin password login logic.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Performs a one-time backend health check using the actor, logging diagnostic info and tracking status and errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useIsAdmin.ts": "Uses the authenticated actor to query whether the current user is an admin, exposing loading and fetched states.",
  "frontend/src/hooks/usePageSeo.ts": "Updates document title, meta tags, Open Graph data, Twitter tags, and optional article JSON-LD based on provided SEO config.",
  "frontend/src/hooks/useRecaptchaV3.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useScrollToHashSection.ts": "Scrolls smoothly to a DOM element matching the URL hash whenever the hash changes.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Submits contact form data through the backend actor and returns a mutation with error parsing and query invalidation.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, theming, typography, and utility classes.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminEntryPage.tsx": "Determines whether to show admin submissions, access denied, or loading state based on identity and admin status.",
  "frontend/src/pages/admin/ContactSubmissionsAdminPage.tsx": "Displays and manages admin contact submissions with backend health checks, selection UI, and logout functionality.",
  "frontend/src/pages/diagnostics/DraftVsLiveDiagnosticsPage.tsx": "Diagnostics page that displays environment details and backend health status to compare draft and live deployments.",
  "frontend/src/pages/offers/ChooseYourOwnAdventurePage.tsx": "Offer detail page rendering the 'Choose Your Own Adventure' post with SEO setup, article sections, and a contact CTA.",
  "frontend/src/pages/offers/FlexibleAsHellPage.tsx": "Offer detail page for the 'Flexible As Hell' experience, loading post content, SEO metadata, and a contact CTA.",
  "frontend/src/pages/offers/OffTheBeatenPathPage.tsx": "Offer detail page for the 'Off the Beaten Path' post, showing title, sections, and a final contact CTA.",
  "frontend/src/pages/offers/PrivateAndPersonalPage.tsx": "Offer page presenting the 'Private and Personal' content with SEO config, structured sections, and a contact CTA.",
  "frontend/src/pages/offers/StayYourWayPage.tsx": "Offer detail page showcasing the 'Stay Your Way' post with article content, SEO settings, and a contact CTA.",
  "frontend/src/pages/offers/StoriesAndBanterPage.tsx": "Offer page for the 'Stories and Banter' experience, rendering post sections and including SEO and a CTA.",
  "frontend/src/types/recaptcha.d.ts": "Empty type declaration file for reCAPTCHA definitions.",
  "frontend/src/utils/formatTimestamp.ts": "Converts a bigint nanosecond timestamp to a formatted US locale date-time string.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and plugin settings for the frontend.",
  "project_state.json": "Project state file describing deployment issues, existing features, and new feature requests for draft-vs-live diagnostics and canister identity reporting."
}