{
  "backend/main.mo": "Motoko canister implementing user profiles, admin bootstrap via hardcoded credentials, access control checks, system user counters, and contact form submission types with permission-gated operations.",
  "feature_evidence.json": "Feature evidence report describing implemented admin-only contact submissions page, legacy route aliasing, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files, detailing routing, UI components, content files, hooks, styles, and configuration.",
  "frontend/.env.production.example": "Example production environment file noting that no environment variables are currently required.",
  "frontend/index.css": "Global Tailwind base and custom OKLCH color variables defining theming for light and dark modes across the app.",
  "frontend/index.html": "Root HTML document that preloads the hero background image and mounts the frontend React application.",
  "frontend/PRODUCTION_CONFIGURATION.md": "Documentation explaining production admin access flow, contact form spam protection, data storage rules, and deployment checklist.",
  "frontend/PRODUCTION_DEPLOYMENT_NOTES.md": "Placeholder deployment notes file for production version 33 with no specific content.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Smoke test checklist describing landing page validation, offer route loading behavior, and contact form functionality tests.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with lazy‑loaded offer and admin pages and renders the router provider.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Displays an access‑denied screen that handles Internet Identity login and fallback admin credential entry.",
  "frontend/src/components/landing/ContactForm.tsx": "Implements a contact form with validation, bot detection, and submission handling via a custom hook.",
  "frontend/src/components/landing/ContactSection.tsx": "Renders the contact section with location info, email details, and the contact form.",
  "frontend/src/components/landing/Footer.tsx": "Provides the site footer with branding, social links, contact options, and a WhatsApp CTA.",
  "frontend/src/components/landing/HeroSection.tsx": "Displays the hero banner with main title, tagline, and CTAs including TripAdvisor.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the main landing page with background image, hero, offers, reviews, contact, and footer sections.",
  "frontend/src/components/landing/OffersSection.tsx": "Displays a grid of six tour feature cards linking to offer pages with animated styling.",
  "frontend/src/components/landing/ReviewCard.tsx": "Renders a single review with star rating, excerpt, and reviewer name.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Shows a reviews section using curated reviews and includes a TripAdvisor CTA button.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled external link button directing users to the TripAdvisor review page.",
  "frontend/src/components/offers/GetInTouchCtaLink.tsx": "A CTA link component that routes to the homepage and scrolls to the contact section.",
  "frontend/src/content/countryCallingCodes.ts": "Exports a list of country calling code options used for phone number selection.",
  "frontend/src/content/curatedReviews.ts": "Contains hardcoded curated customer reviews with ratings and excerpts.",
  "frontend/src/content/offersPosts.ts": "Defines structured offer post content including metadata and multi-section text for each tour type.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminBootstrapAccess.ts": "Handles admin bootstrap logic using username/password and refreshes admin queries on success.",
  "frontend/src/hooks/useAdminContactSubmissions.ts": "Provides hooks to fetch normal and junk contact submissions with admin access handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and provider for managing Internet Identity auth, handling login, stored identities, and status flags.",
  "frontend/src/hooks/usePageSeo.ts": "React hook that sets page title, meta tags, Open Graph/Twitter tags, canonical links, and optional JSON-LD schema.",
  "frontend/src/hooks/useRecaptchaV3.ts": "Empty placeholder file for a future reCAPTCHA v3 hook.",
  "frontend/src/hooks/useScrollToHashSection.ts": "Scrolls smoothly to the element matching the URL hash whenever the hash changes.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Uses React Query to submit contact form data via backend actor and refresh related queries on success.",
  "frontend/src/index.css": "Tailwind base setup defining CSS variables, themes, typography, and utility classes including text shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/ContactSubmissionsAdminPage.tsx": "Admin page showing normal and junk contact submissions with authentication, tab switching, and detail viewing.",
  "frontend/src/pages/offers/ChooseYourOwnAdventurePage.tsx": "Renders the Choose Your Own Adventure offer page with SEO tags, styled article content, and a contact CTA.",
  "frontend/src/pages/offers/FlexibleAsHellPage.tsx": "Renders the Flexible As Hell offer page with SEO setup, structured article content, and a contact CTA.",
  "frontend/src/pages/offers/OffTheBeatenPathPage.tsx": "Renders the Off the Beaten Path offer page using post data, SEO setup, and styled article sections with a CTA.",
  "frontend/src/pages/offers/PrivateAndPersonalPage.tsx": "Displays the Private and Personal offer page with SEO config, dynamic post content, and a call‑to‑action section.",
  "frontend/src/pages/offers/StayYourWayPage.tsx": "Shows the Stay Your Way offer page, pulling structured post content and applying SEO and themed layout components.",
  "frontend/src/pages/offers/StoriesAndBanterPage.tsx": "Provides the Stories and Banter offer page with SEO metadata, post-driven article rendering, and a CTA footer.",
  "frontend/src/types/recaptcha.d.ts": "Empty TypeScript declaration file for future reCAPTCHA type definitions.",
  "frontend/src/utils/formatTimestamp.ts": "Converts a bigint nanosecond timestamp to a human-readable localized date string.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters, supporting both query strings and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and theme settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, architectural notes, issues, and feature requests for persistent contact form storage and a protected admin messages page."
}