{
  "backend/main.mo": "Actor implements admin RBAC bootstrap, user profile storage, and contact form submission handling using AccessControl and Map structures.",
  "backend/migration.mo": "Migration module resets the firstAdminBootstrapped flag to false during upgrades.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries of various frontend files describing UI components, hooks, styles, and content modules.",
  "frontend/.env.production.example": "Example production environment variable file showing optional build metadata fields for the frontend.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based color variables, dark mode values, and base styles.",
  "frontend/index.html": "Base HTML file loading the React app and preloading the hero background image.",
  "frontend/PRODUCTION_CONFIGURATION.md": "Documentation for production admin access flow, RBAC behavior, and first‑time admin bootstrap instructions.",
  "frontend/PRODUCTION_DEPLOYMENT_NOTES.md": "Guidelines for building and deploying the application to production, including draft vs live explanation and prerequisites.",
  "frontend/public/.ic-assets.json": "IC asset configuration specifying well-known files with explicit cache settings.",
  "frontend/public/.well-known/ic-domains": "List of approved domains for IC domain verification.",
  "frontend/public/.well-known/ii-alternative-origins": "Defines alternative origins allowed for Internet Identity authentication.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Production smoke test checklist validating landing page, offer routes, and contact form functionality after deployment.",
  "frontend/src/App.tsx": "Sets up the app's root layout, backend health check, and all routes with lazy‑loaded pages and loading fallbacks.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Displays login prompts or access‑denied UI for admin users and handles login, logout, and bootstrap/reset admin actions.",
  "frontend/src/components/diagnostics/BuildEnvironmentIndicator.tsx": "Shows hostname, mode, and build metadata with fallbacks and logs environment info to the console.",
  "frontend/src/components/landing/ContactForm.tsx": "Implements a contact form with validation, bot‑detection timing, submission handling, and a success state.",
  "frontend/src/components/landing/ContactSection.tsx": "Renders the contact section with email/WhatsApp info cards and includes the ContactForm.",
  "frontend/src/components/landing/Footer.tsx": "Displays footer with social links, contact actions, branding, and the build environment indicator.",
  "frontend/src/components/landing/HeroSection.tsx": "Renders the hero banner with title, tagline, CTA buttons, and a scroll indicator.",
  "frontend/src/components/landing/LandingPage.tsx": "Composes the landing page with background imagery and sections for hero, offers, reviews, contact, and footer while enabling hash-based scrolling.",
  "frontend/src/components/landing/OffersSection.tsx": "Displays a grid of feature cards linking to offer pages, each with icons, emojis, descriptions, and styled interactions.",
  "frontend/src/components/landing/ReviewCard.tsx": "Renders an individual review card showing star rating, excerpt, and reviewer with animated styling.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Shows a reviews section containing multiple review cards from curated data and a TripAdvisor call‑to‑action.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled external link button directing users to the TripAdvisor review page.",
  "frontend/src/components/offers/GetInTouchCtaLink.tsx": "Reusable CTA link that routes to the homepage and scrolls to the contact section via hash navigation.",
  "frontend/src/content/countryCallingCodes.ts": "Defines a list of country calling code options for use in forms or selectors.",
  "frontend/src/content/curatedReviews.ts": "Exports curated review data with reviewer names, ratings, and excerpts for display in the reviews section.",
  "frontend/src/content/offersPosts.ts": "Stores offer post metadata and long‑form sectioned content keyed by slug for offer detail pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminBootstrapAccess.ts": "Mutation hook to grant admin rights to the authenticated user and invalidate admin‑related queries.",
  "frontend/src/hooks/useAdminContactSubmissions.ts": "Fetches all contact submissions via the actor with auth‑aware error handling and query control.",
  "frontend/src/hooks/useAdminPasswordLogin.ts": "Empty file placeholder for admin password login logic.",
  "frontend/src/hooks/useAdminResetBootstrap.ts": "Mutation hook to reset the admin bootstrap flag and refresh related queries.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Performs a one-time backend connectivity and deployment info check, updating health state and logging diagnostics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context with login, logout, and status handling via AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Checks if the current authenticated user is an admin using the backend actor and react-query.",
  "frontend/src/hooks/usePageSeo.ts": "Sets page SEO metadata, Open Graph tags, Twitter tags, and optional JSON-LD on mount.",
  "frontend/src/hooks/useRecaptchaV3.ts": "Empty placeholder file for a future reCAPTCHA v3 hook.",
  "frontend/src/hooks/useScrollToHashSection.ts": "Scrolls smoothly to the DOM element matching the URL hash on mount or hash changes.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Submits contact form data to the backend with validation, spam detection handling, and error mapping.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, dark mode themes, typography, and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminEntryPage.tsx": "Loads the admin submissions page for authenticated admins or shows access denied or loading states.",
  "frontend/src/pages/admin/ContactSubmissionsAdminPage.tsx": "Admin page that fetches and displays contact submissions, handles access control, and shows backend health diagnostics. Provides submission selection, refresh, and logout behavior.",
  "frontend/src/pages/diagnostics/DraftVsLiveDiagnosticsPage.tsx": "Public diagnostics page comparing draft vs live deployments, showing frontend metadata, backend health, and canister identity info. Includes copy‑to‑clipboard and guidance for interpreting environment mismatches.",
  "frontend/src/pages/offers/ChooseYourOwnAdventurePage.tsx": "Offer article page rendering content for the 'Choose Your Own Adventure' package using SEO hooks and dynamic sections. Includes themed layout, navigation, and a contact CTA.",
  "frontend/src/pages/offers/FlexibleAsHellPage.tsx": "Offer article page for the 'Flexible As Hell' package that loads post data, applies SEO, and displays sections with a CTA. Uses the same styled layout and navigation as other offer pages.",
  "frontend/src/pages/offers/OffTheBeatenPathPage.tsx": "Offer article page presenting the 'Off the Beaten Path' package with SEO metadata and dynamically rendered content sections. Includes consistent layout, styling, and a CTA.",
  "frontend/src/pages/offers/PrivateAndPersonalPage.tsx": "Offer article page for the 'Private and Personal' package, applying SEO and rendering structured content. Follows the shared offer layout with navigation and a contact CTA.",
  "frontend/src/pages/offers/StayYourWayPage.tsx": "Renders the Stay Your Way offer page using dynamic post content, SEO setup, and a styled article layout with sections and CTA.",
  "frontend/src/pages/offers/StoriesAndBanterPage.tsx": "Renders the Stories and Banter offer page with dynamic post data, SEO initialization, and a formatted article layout and CTA.",
  "frontend/src/types/recaptcha.d.ts": "Empty TypeScript declaration file for recaptcha types.",
  "frontend/src/utils/formatTimestamp.ts": "Formats a bigint nanosecond timestamp into a human‑readable US locale date string.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL params, storing/retrieving them in sessionStorage, and handling hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, container settings, plugins, and custom keyframes.",
  "project_state.json": "Tracks project state, requirements, and pending features related to admin bootstrapping recovery."
}