{
  "backend/main.mo": "Main canister logic handling user profiles, access control, and contact form submissions including new phone fields and admin-only junk submission retrieval.",
  "backend/migration.mo": "Migration module converting old contact submissions to the new format by adding empty phone fields.",
  "feature_evidence.json": "Feature evidence report mapping new phone field UI, data lists, submission logic, and smoke tests to their corresponding frontend files.",
  "frontend-file-summaries.txt": "Collection of autogenerated short summaries for all frontend source files and their roles.",
  "frontend/.env.production.example": "Example production env file showing how to set the public reCAPTCHA site key.",
  "frontend/index.css": "Tailwind setup defining CSS variables for light and dark themes plus base styling.",
  "frontend/index.html": "Base HTML template loading the main React entry and preloading assets.",
  "frontend/PRODUCTION_CONFIGURATION.md": "Documentation describing required frontend and backend reCAPTCHA configuration and post‑deploy steps.",
  "frontend/PRODUCTION_DEPLOYMENT_NOTES.md": "Deployment notes file stub containing versioned production build information.",
  "frontend/SMOKE_TEST_PRODUCTION.md": "Production smoke test checklist covering landing page, lazy‑loaded routes, contact form, reCAPTCHA, and phone field behavior.",
  "frontend/src/App.tsx": "Configures TanStack router with lazy‑loaded offer pages and renders the router.",
  "frontend/src/components/landing/ContactForm.tsx": "Interactive contact form with validation, reCAPTCHA v3, and submission handling.",
  "frontend/src/components/landing/ContactSection.tsx": "Contact section that loads reCAPTCHA when visible and displays contact info plus the form.",
  "frontend/src/components/landing/Footer.tsx": "Footer with branding, social links, and contact shortcuts.",
  "frontend/src/components/landing/HeroSection.tsx": "Hero section with title, tagline, background overlay, and primary CTAs.",
  "frontend/src/components/landing/LandingPage.tsx": "Landing page composing hero, offers, reviews, contact, and footer over a fixed background.",
  "frontend/src/components/landing/OffersSection.tsx": "Displays a grid of feature cards linking to offer pages with icons, emojis, and descriptions.",
  "frontend/src/components/landing/ReviewCard.tsx": "Renders a single review with star ratings, excerpt text, and reviewer name.",
  "frontend/src/components/landing/ReviewsSection.tsx": "Shows a titled reviews section that lists curated reviews and includes a TripAdvisor call‑to‑action.",
  "frontend/src/components/landing/TripAdvisorCta.tsx": "Provides a styled external link button directing users to the TripAdvisor review page.",
  "frontend/src/components/offers/GetInTouchCtaLink.tsx": "Reusable CTA link that routes to the home page and scrolls to the contact section.",
  "frontend/src/content/countryCallingCodes.ts": "Exports a list of country calling code options used for phone number selection.",
  "frontend/src/content/curatedReviews.ts": "Defines and exports an array of curated 5‑star reviews with reviewer info and excerpts.",
  "frontend/src/content/offersPosts.ts": "Contains structured content for offer detail pages, including metadata and sectioned text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity auth, including login, logout, and identity loading.",
  "frontend/src/hooks/usePageSeo.ts": "Sets document title, meta tags, Open Graph, Twitter tags, canonical link, and optional JSON-LD article schema based on provided SEO config.",
  "frontend/src/hooks/useRecaptchaV3.ts": "Loads and initializes reCAPTCHA v3 on demand and exposes methods to execute actions and track readiness or errors.",
  "frontend/src/hooks/useScrollToHashSection.ts": "Scrolls smoothly to the DOM element matching the current URL hash whenever it changes.",
  "frontend/src/hooks/useSubmitContactForm.ts": "Submits contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind layers, global theme variables for light/dark modes, typography, and custom utility classes for text effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/offers/ChooseYourOwnAdventurePage.tsx": "Renders the Choose Your Own Adventure offer page with SEO setup, post content sections, and a contact CTA.",
  "frontend/src/pages/offers/FlexibleAsHellPage.tsx": "Renders the Flexible As Hell offer page with SEO setup, structured content, and a contact CTA.",
  "frontend/src/pages/offers/OffTheBeatenPathPage.tsx": "Renders the Off The Beaten Path offer page with SEO metadata, post sections, and a contact CTA.",
  "frontend/src/pages/offers/PrivateAndPersonalPage.tsx": "Renders the Private and Personal offer page, pulling post data from offerPosts and applying SEO setup with styled article content and CTA.",
  "frontend/src/pages/offers/StayYourWayPage.tsx": "Displays the Stay Your Way offer page using offerPosts data with SEO configuration and structured article sections plus a CTA link.",
  "frontend/src/pages/offers/StoriesAndBanterPage.tsx": "Provides the Stories and Banter offer page, loading content from offerPosts and rendering SEO metadata, article sections, and a CTA.",
  "frontend/src/types/recaptcha.d.ts": "Adds TypeScript declarations for the grecaptcha object on the window to support reCAPTCHA ready and execute methods.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL parameters, persisting them in sessionStorage, and clearing them from hashes for routing and state handling.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and extended theme values.",
  "project_state.json": "Tracks project state, listing existing features, pending requests, and requirements related to adding phone number support to the contact form."
}