{
  "kind": "build_request",
  "title": "Store contact form submissions and provide an admin panel to view them",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the existing website contact form save each submission in the backend and return a successful response to the frontend so the user sees the success state after submitting.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "there is a contact form on the website..... when someone fills it in I want to be able to access their message in the admin pannel"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the contact form from the landing page completes without client-side errors and shows the existing success UI state.",
        "A successful submission is persisted in the backend as a ContactSubmission record with name, email, phone fields (calling code + number), message, and timestamp.",
        "If the backend is unavailable or rejects the submission, the form shows a clear error message (using the existing error UI)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement reCAPTCHA/spam-handling on the backend submission endpoint by using the provided reCAPTCHA token and the configured minimum score, and store low-confidence or bot-like submissions in the junk submissions collection.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "there is a contact form on the website..... when someone fills it in I want to be able to access their message in the admin pannel"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo submitContactForm() uses the provided recaptcha token parameter (currently named _recaptchaToken) and verifies it server-side (when a secret key is configured).",
        "Submissions that fail honeypot/elapsed-time checks and/or fail reCAPTCHA verification (or fall below the configured min score) are stored via the existing junk storage path, not mixed into normal submissions.",
        "Valid submissions are stored in the normal submissions collection and are retrievable via the existing admin-only getAllContactSubmissions() query.",
        "Behavior is deterministic and does not trap for common spam outcomes (it should store as junk and return an id)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an in-app admin page (admin panel) that allows an admin user to view contact form submissions stored in the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want to be able to access their message in the admin pannel"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists in the React app for an admin submissions page (reachable by URL) that lists stored contact submissions.",
        "The page fetches data from the backend admin-only queries (getAllContactSubmissions and getAllContactSubmissionsJunk) and renders submission rows with at least timestamp, name, email, phone, and a message preview.",
        "An admin can open a submission to view the full message content.",
        "If a non-admin visits the admin page or the query traps as unauthorized, the UI shows an English access-denied message and does not crash.",
        "The page supports manual refresh (button) that refetches the submissions list via React Query."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other immutablePaths listed in SYSTEM_CONTEXT.",
    "Use Internet Identity / existing access-control initialization flow (do not add third-party auth)."
  ],
  "nonGoals": [
    "Sending contact form submissions via email or SMS.",
    "Adding third-party admin dashboards or external databases.",
    "Implementing real-time updates (WebSockets) for incoming submissions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}