{
  "kind": "build_request",
  "title": "Persist contact form submissions and add protected admin messages page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist contact form submissions in the Motoko canister using stable storage so submissions survive canister upgrades. Store at minimum: name, email, phone number (including country calling code), message, and a timestamp, and ensure every successful submission is saved to stable storage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Save every submission permanently to a secure database. Store at minimum: name, email, phone number and message"
        ]
      },
      "acceptanceCriteria": [
        "After submitting the contact form, the submission is returned by an admin-only query even after a canister upgrade (no data loss).",
        "Stored submission data includes: name, email, phoneCountryCallingCode, phoneNumber, message, timestamp (and an id if used).",
        "submitContactForm continues to accept the existing parameters used by the frontend (including honeypot and elapsedTime) and saves non-junk submissions to the main storage."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend admin bootstrapping via username/password by adding a canister method that the frontend can call (`bootstrapAdminWithCredentials(username, password)`) to grant admin permissions to the authenticated caller after successful credential verification. Configure the credentials to match: username `dirtydave69`, password `Tomlikesboys69`. Store/compare the password securely (do not store plaintext passwords in canister state).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make sure it's protected — only I can access it. username dirtydave69\npassword Tomlikesboys69"
        ]
      },
      "acceptanceCriteria": [
        "Calling `bootstrapAdminWithCredentials` with incorrect credentials traps with an authorization/invalid-credentials error.",
        "Calling `bootstrapAdminWithCredentials` with the correct credentials grants the caller admin permission so subsequent calls to `getAllContactSubmissions` and `getAllContactSubmissionsJunk` succeed for that caller.",
        "The password is not stored in plaintext in canister stable state (e.g., store a hash and compare hashes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure admin-only retrieval endpoints for contact submissions return all saved submissions (normal and junk) and are protected by admin permission checks.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a private admin-only page ... (make sure it's protected — only I can access it.)"
        ]
      },
      "acceptanceCriteria": [
        "`getAllContactSubmissions` is admin-only and returns all non-junk submissions sorted by timestamp.",
        "`getAllContactSubmissionsJunk` is admin-only and returns all junk submissions sorted by timestamp.",
        "Non-admin callers receive an authorization error that the frontend maps to access denied."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Create a private admin-only page for viewing contact form submissions at either `/admin/contact` or `/dashboard/messages` (choose one and implement it). The page must be protected so only an authenticated Internet Identity user with admin permissions can view submissions; otherwise show the existing access-denied flow with credential bootstrap.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a private admin-only page at /admin/contact or /dashboard/messages (make sure it's protected — only I can access it.)"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to the chosen route renders the submissions admin UI.",
        "If the visitor is not authenticated with Internet Identity, the page shows the access denied screen prompting Internet Identity login.",
        "If authenticated but not an admin yet, the page shows the credential bootstrap UI and, after successful bootstrap, loads submissions.",
        "Once admin access is granted, the page lists saved submissions and allows viewing details (using the existing admin submissions UI behavior)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Keep existing admin route compatibility by redirecting or aliasing the current `/admin/submissions` route to the new admin messages route, so previously shared links continue to work.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a private admin-only page at /admin/contact or /dashboard/messages"
        ]
      },
      "acceptanceCriteria": [
        "Visiting `/admin/submissions` still reaches the admin submissions UI (either via redirect or rendering the same page component).",
        "The new chosen route and `/admin/submissions` both enforce the same access control behavior."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if needed for stable-state upgrades.",
    "Do not edit files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not store admin passwords in plaintext in canister state or in frontend code."
  ],
  "nonGoals": [
    "Integrating an external database (PostgreSQL/MySQL/MongoDB/Redis) or any non-IC storage service.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Implementing real-time updates (WebSockets/push notifications) for new submissions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}