{
  "kind": "build_request",
  "title": "Deploy current app draft (Version 33) live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deploy the current codebase (Version 33) to production on the Internet Computer, upgrading both the backend canister and the frontend asset canister using the existing single-actor backend architecture.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ok lets take this version live now"
        ]
      },
      "acceptanceCriteria": [
        "A production deployment is completed using the current Version 33 sources.",
        "Backend canister is upgraded successfully without breaking existing stable data.",
        "Frontend loads successfully in production and routes render (/, and all /offers/* pages)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Run a production smoke test after deployment covering: landing page render, offer-page navigation, contact form submission path (including reCAPTCHA readiness handling), and admin-only backend queries remaining protected by access control.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ok lets take this version live now"
        ]
      },
      "acceptanceCriteria": [
        "Landing page renders without console errors.",
        "Each offer route loads and the lazy-loading fallback shows appropriately during load.",
        "Contact form can be submitted end-to-end (or shows the existing configured error state if reCAPTCHA is not configured), and the UI reaches the success state on a valid submission.",
        "Unauthenticated callers cannot access admin-only query methods (e.g., getAllContactSubmissions, getAllContactSubmissionsJunk)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify production configuration needed for the deployed version is in place (e.g., reCAPTCHA settings expected by the frontend and backend), and document any required post-deploy admin steps (such as setting the reCAPTCHA secret via the existing admin method) to make the live contact form fully operational.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "ok lets take this version live now"
        ]
      },
      "acceptanceCriteria": [
        "A short deployment note exists stating whether reCAPTCHA is configured in production and, if not, the exact admin action required to configure it using the existing backend method.",
        "No user-facing placeholders or broken configuration states are introduced by the deployment."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features or changing UI/UX beyond what is necessary to deploy Version 33.",
    "Implementing third-party auth beyond Internet Identity.",
    "Adding external databases, non-Motoko backend services, or real-time/WebSocket functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}