{
  "kind": "build_request",
  "title": "Update location card heading text and replace footer attribution",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "In `frontend/src/components/landing/ContactSection.tsx`, remove the location card heading text \"Start Your Adventure\" and remove any \"Location?\" text if present, but keep the Scotland flag emoji visible in that heading area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove the heading \"start your adventure\" with Location? but keep the scotland flag emoji"
        ]
      },
      "acceptanceCriteria": [
        "The location card heading no longer contains the words \"Start Your Adventure\".",
        "If the text \"Location?\" appears anywhere in the location card, it is removed.",
        "The Scotland flag emoji (🏴) remains visible in the location card heading area."
      ]
    },
    {
      "id": "REQ-7",
      "text": "In `frontend/src/components/landing/Footer.tsx`, remove the existing bottom attribution that links to caffeine.ai (\"Built with ... using caffeine.ai\") and replace it with exactly: \"built by Dave and thats why the website is so shit\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove the built by caffeine AI from the bottom of the website and replace it with \"built by Dave and thats why the website is so shit\""
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer displays any \"Built with\" / \"caffeine.ai\" attribution text or link.",
        "The footer displays exactly the text: \"built by Dave and thats why the website is so shit\" (matching spelling and casing)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (compose them instead).",
    "Do not modify any files listed as immutable by the system context (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`)."
  ],
  "nonGoals": [
    "Do not add CAPTCHA or other spam-prevention changes to the contact form in this build request.",
    "Do not change backend canister logic or data schema."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}