{
  "kind": "build_request",
  "title": "Add draft-vs-live deployment verification diagnostics and canister identity reporting",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query method that returns unambiguous deployment/runtime identity information so the frontend can confirm it is talking to the intended live backend canister (e.g., include the backend canister principal ID and current canister time).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Immediately compare the current draft with the live version (if any exists) and identify why deployment is blocked or failing (e.g. sync issue, deployment error, greyed-out publish button, SSL/canister problem, or draft/live mismatch)."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a public query method (e.g., deployment info) callable by anonymous users without trapping.",
        "Returned payload includes the backend canister Principal (as text) and a server-side timestamp.",
        "No state migration is required; upgrade does not break existing contact form/admin features."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance the frontend backend-health-check diagnostics to retrieve and display the backend deployment identity information (canister ID + server timestamp) and to log a single clearly labeled diagnostic line that helps detect draft/live mismatch (e.g., frontend host vs backend canister ID).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Instead: Immediately compare the current draft with the live version (if any exists) and identify why deployment is blocked or failing (e.g. sync issue, deployment error, greyed-out publish button, SSL/canister problem, or draft/live mismatch)."
        ]
      },
      "acceptanceCriteria": [
        "`useBackendHealthCheck` continues to perform the existing `testConnection` check and additionally attempts to fetch backend deployment identity info.",
        "On success, console output includes one labeled line that contains: current hostname + backend canister ID + build version info (if available).",
        "On failure, console output includes one labeled line with hostname and the exact error message (no repeated loops/spam).",
        "Hook return value includes the fetched backend canister ID (when available) for use in UI components."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an in-app \"Draft vs Live Verification\" diagnostics view that makes it obvious which environment a user is currently viewing and whether the frontend is connected to the expected backend (show hostname, build version/timestamp, backend canister ID, and backend health status).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add a brand new draft version (or just keep regenerating the draft code) and the live site never updates. The website is still not published to production."
        ]
      },
      "acceptanceCriteria": [
        "Diagnostics view can be accessed without admin privileges (e.g., via a dedicated route or a query-param gated panel) and does not expose sensitive data.",
        "View displays: current hostname, build mode/prod flag, build version, build timestamp, backend health status, backend canister ID, and backend server timestamp.",
        "View includes clear English copy explaining how to interpret mismatches (e.g., “If hostname is a live domain but backend canister ID differs from expected, publish/binding may be misconfigured”).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the admin \"Backend Connectivity\" diagnostics UI to include backend canister identity info when available and provide more actionable troubleshooting guidance specifically for draft/live mismatch and missing backend deployment scenarios.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Resolve whatever is preventing the push: correct any inconsistencies, retry the deployment process, or apply the necessary backend fix so that publish actually works this time."
        ]
      },
      "acceptanceCriteria": [
        "Admin page diagnostics shows backend canister ID and backend server timestamp when health check data is available.",
        "If backend is unhealthy, UI shows the captured error message and a short checklist that distinguishes: (1) frontend published but backend not, (2) canister binding mismatch, (3) network/agent errors.",
        "UI changes do not break existing admin access flow and do not require new auth mechanisms."
      ]
    }
  ],
  "constraints": [
    "Do not create or require additional backend canisters/services; keep Motoko logic in the existing single actor (backend/main.mo).",
    "Do not edit files under frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Do not introduce third-party auth or external deployment services; keep Internet Identity as-is.",
    "Do not regenerate or restructure unrelated app features (landing page, offers pages, contact form) while implementing diagnostics."
  ],
  "nonGoals": [
    "Actually performing or automating the Caffeine platform publish/deploy action within application code.",
    "Adding new product features unrelated to deployment verification (e.g., new landing sections, new forms, payments, chat).",
    "Introducing external monitoring/logging services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}