{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Version 33 production readiness (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prepare frontend asset canister build/config notes for deploying Version 33 and ensure required routes/assets load in production.",
      "acceptanceCriteria": [
        "A production deployment is completed using the current Version 33 sources.",
        "Frontend loads successfully in production and routes render (/, and all /offers/* pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_DEPLOYMENT_NOTES.md",
          "operation": "create",
          "description": "Add concise production deployment notes for the frontend asset canister: build command, environment-variable expectations (VITE_RECAPTCHA_SITE_KEY), and a route verification checklist for / and all /offers/* pages."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify production-safe asset references and preloads remain correct for the hero background image, and that reCAPTCHA DNS-prefetch remains present (no functional changes beyond what is necessary for Version 33 production deployment)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify the router continues to include / and all /offers/* routes required for production, and that lazy-loaded offer pages remain wrapped in Suspense with the existing loading fallback."
        },
        {
          "path": "frontend/public/assets/generated/dirty-daves-hero-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the generated asset at the exact path frontend/public/assets/generated/dirty-daves-hero-bg.dim_1920x1080.png so production builds can serve the preloaded hero image correctly."
        },
        {
          "path": "frontend/public/assets/generated/dirty-daves-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated asset at the exact path frontend/public/assets/generated/dirty-daves-logo.dim_512x512.png so production builds can reference the logo as needed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a production smoke-test checklist for frontend routing, lazy-load fallback, and contact form submission behavior (including reCAPTCHA readiness/error states) plus an access-control verification step.",
      "acceptanceCriteria": [
        "Landing page renders without console errors.",
        "Each offer route loads and the lazy-loading fallback shows appropriately during load.",
        "Contact form can be submitted end-to-end (or shows the existing configured error state if reCAPTCHA is not configured), and the UI reaches the success state on a valid submission.",
        "Unauthenticated callers cannot access admin-only query methods (e.g., getAllContactSubmissions, getAllContactSubmissionsJunk)."
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_PRODUCTION.md",
          "operation": "create",
          "description": "Create a production smoke-test checklist covering: (1) landing page render + console errors check, (2) navigation to each /offers/* route and confirming the Suspense fallback appears during load, (3) contact form submission including the expected UI behavior when reCAPTCHA is configured vs not configured, and (4) verifying admin-only backend queries remain protected by access control (use the authorization component’s role-based access control behavior as the expected baseline; Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/landing/ContactForm.tsx",
          "operation": "modify",
          "description": "Harden the contact form’s production UX for smoke testing: ensure the existing reCAPTCHA readiness/configuration error states are clearly surfaced and do not cause console errors; keep behavior aligned with Version 33 (no feature additions)."
        },
        {
          "path": "frontend/src/hooks/useRecaptchaV3.ts",
          "operation": "modify",
          "description": "Ensure reCAPTCHA initialization/execute paths remain robust in production (script load, ready callback, and error propagation) so the smoke test can reliably validate readiness handling and configured/unconfigured states."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Document production configuration requirements for reCAPTCHA and any post-deploy admin steps needed to fully enable the live contact form without introducing broken placeholder states.",
      "acceptanceCriteria": [
        "A short deployment note exists stating whether reCAPTCHA is configured in production and, if not, the exact admin action required to configure it using the existing backend method.",
        "No user-facing placeholders or broken configuration states are introduced by the deployment."
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_CONFIGURATION.md",
          "operation": "create",
          "description": "Document the frontend production configuration expectations for Version 33, including VITE_RECAPTCHA_SITE_KEY and how the UI behaves when it is missing; include a short 'post-deploy admin step' note instructing how to complete reCAPTCHA setup using the existing backend admin method (described at a high level; do not include sensitive secrets)."
        },
        {
          "path": "frontend/.env.production.example",
          "operation": "create",
          "description": "Add an example production env file documenting VITE_RECAPTCHA_SITE_KEY for the frontend build (example values only; no real secrets)."
        },
        {
          "path": "frontend/src/components/landing/ContactSection.tsx",
          "operation": "modify",
          "description": "Verify the contact section’s deferred reCAPTCHA loading trigger remains compatible with production configuration: when configured, it should initialize when visible; when not configured, it should not cause broken states."
        }
      ]
    }
  ]
}