{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin panel for viewing stored contact form submissions",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the landing-page contact form submits to the backend successfully and surfaces success/error states reliably.",
      "acceptanceCriteria": [
        "Submitting the contact form from the landing page completes without client-side errors and shows the existing success UI state.",
        "A successful submission is persisted in the backend as a ContactSubmission record with name, email, phone fields (calling code + number), message, and timestamp.",
        "If the backend is unavailable or rejects the submission, the form shows a clear error message (using the existing error UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSubmitContactForm.ts",
          "operation": "modify",
          "description": "Align React Query invalidation keys with the new admin submissions queries (so admin lists can be refreshed after a successful form submission), and ensure backend failures propagate a clear Error message for the existing error UI to display."
        },
        {
          "path": "frontend/src/components/landing/ContactForm.tsx",
          "operation": "modify",
          "description": "Confirm the existing error UI renders readable messages for backend unavailability/authorization traps, and ensure the submit flow keeps using the existing success state UI after mutation success."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an admin-only React route to view normal and junk contact submissions with drill-in and manual refresh.",
      "acceptanceCriteria": [
        "A new route exists in the React app for an admin submissions page (reachable by URL) that lists stored contact submissions.",
        "The page fetches data from the backend admin-only queries (getAllContactSubmissions and getAllContactSubmissionsJunk) and renders submission rows with at least timestamp, name, email, phone, and a message preview.",
        "An admin can open a submission to view the full message content.",
        "If a non-admin visits the admin page or the query traps as unauthorized, the UI shows an English access-denied message and does not crash.",
        "The page supports manual refresh (button) that refetches the submissions list via React Query."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ContactSubmissionsAdminPage.tsx",
          "operation": "create",
          "description": "Create the admin submissions page UI that renders tabs/sections for normal vs junk submissions, shows a list with message previews, supports selecting a submission to view full message content, and includes a manual refresh button wired to React Query refetch. Use the authorization component’s role-based access control guidance to handle unauthorized/trap errors gracefully (show an English access-denied message). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminContactSubmissions.ts",
          "operation": "create",
          "description": "Add React Query hooks to fetch normal and junk submissions via the backend actor (getAllContactSubmissions, getAllContactSubmissionsJunk), including stable query keys and error mapping for unauthorized/trap cases. Use the authorization component guidance for handling authorization failures in UI without crashes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Add a small reusable AccessDeniedScreen component used by the admin submissions page when the user is not logged in or backend calls fail as unauthorized. Use the authorization component’s UI guidance for access-denied states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/formatTimestamp.ts",
          "operation": "create",
          "description": "Create a utility to format ContactSubmission.timestamp (bigint) into a readable date/time string for the admin submissions list."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new admin route (e.g., /admin/submissions) in the TanStack router that renders the ContactSubmissionsAdminPage so it is reachable by URL (no orphan page)."
        }
      ]
    }
  ]
}