{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin messages route + legacy admin submissions alias (frontend-only)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add a private admin-only route at /admin/contact that renders the existing submissions admin UI and enforces Internet Identity + admin permission checks with the existing access-denied bootstrap flow.",
      "acceptanceCriteria": [
        "Navigating to /admin/contact renders the submissions admin UI.",
        "If the visitor is not authenticated with Internet Identity, the page shows the access denied screen prompting Internet Identity login.",
        "If authenticated but not an admin yet, the page shows the credential bootstrap UI and, after successful bootstrap, loads submissions.",
        "Once admin access is granted, the page lists saved submissions and allows viewing details (using the existing admin submissions UI behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for /admin/contact that renders the existing ContactSubmissionsAdminPage (lazy-loaded with the existing PageLoader). Use the existing authorization component patterns (Internet Identity via useInternetIdentity and access-denied bootstrap via AccessDeniedScreen) to keep the page protected. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/ContactSubmissionsAdminPage.tsx",
          "operation": "modify",
          "description": "Confirm the page’s access gating remains correct when accessed from /admin/contact: unauthenticated users see AccessDeniedScreen (Internet Identity login prompt), and authenticated-but-unauthorized users see AccessDeniedScreen with credential bootstrap; on successful bootstrap, submissions load without requiring manual navigation. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/PRODUCTION_CONFIGURATION.md",
          "operation": "modify",
          "description": "Update the documented admin route to include /admin/contact as the primary admin messages/submissions page and note that admin access requires Internet Identity plus credential bootstrap (do not include or store plaintext credentials in this document)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Maintain /admin/submissions compatibility by aliasing it to the new /admin/contact admin messages route with identical access control behavior.",
      "acceptanceCriteria": [
        "Visiting /admin/submissions still reaches the admin submissions UI (either via redirect or rendering the same page component).",
        "The new chosen route and /admin/submissions both enforce the same access control behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Keep /admin/submissions working by aliasing it to the same page as /admin/contact (either render ContactSubmissionsAdminPage for both routes, or implement a redirect). Ensure both routes share the same protected behavior provided by the authorization component’s Internet Identity + access-denied bootstrap flow. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}