{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Temporary admin bootstrap recovery UI + production docs updates",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a temporary Reset Bootstrap button on the authenticated /admin access-denied screen that calls backend resetBootstrap(), shows success/failure UI, and keeps Set Me as Admin available to run immediately after.",
      "acceptanceCriteria": [
        "On /admin, for authenticated non-admin users, a \"Reset Bootstrap\" button is visible alongside the existing \"Set Me as Admin\" button",
        "Clicking \"Reset Bootstrap\" calls `actor.resetBootstrap()` and displays a clear success message when it succeeds",
        "If reset fails, the error is displayed in the existing error area or a new error area without breaking the page",
        "After reset succeeds, clicking \"Set Me as Admin\" successfully grants admin and the user can access the submissions page (assuming no other RBAC issues)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminResetBootstrap.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook that calls the backend capability `resetBootstrap()` via the authenticated actor, with clear error propagation and admin-query invalidation as needed. Use the authorization component patterns for authenticated actor usage and error handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update the authenticated (non-admin) AccessDeniedScreen UI to add a temporary \"Reset Bootstrap\" button next to the existing \"Set Me as Admin\" action. Wire it to the new `useAdminResetBootstrap` hook, add success feedback for reset, and display reset errors without breaking the existing setMeAsAdmin success/error UI. Use authorization component conventions for authenticated-only actions and graceful handling of backend traps. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminBootstrapAccess.ts",
          "operation": "modify",
          "description": "Ensure the existing admin bootstrap mutation keeps working when invoked immediately after a successful reset, and that relevant admin-related queries are invalidated/refetched so /admin can transition to the submissions page. Use authorization component conventions for actor/identity checks and cache invalidation. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an explicit security warning on the authenticated access-denied UI stating resetBootstrap() is temporary and must be removed/disabled after bootstrapping an admin.",
      "acceptanceCriteria": [
        "The access-denied (authenticated) UI includes a warning message stating that resetBootstrap is temporary and should be removed/disabled after bootstrapping admin",
        "The warning text is in English and visible without needing to open devtools"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Add a clearly visible, English security warning in the authenticated access-denied view explaining that the Reset Bootstrap action is temporary and must be removed/disabled after successfully bootstrapping an admin. Keep styling consistent with existing AccessDeniedScreen alert patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update production docs with copy/paste-ready Candid UI URL pattern and steps to call resetBootstrap() then setMeAsAdmin(), including guidance to find backend canister id from the Diagnostics page.",
      "acceptanceCriteria": [
        "frontend/PRODUCTION_CONFIGURATION.md contains a copy/paste-ready URL pattern for Candid UI that includes `?id=<BACKEND_CANISTER_ID>`",
        "The docs explicitly say to call `resetBootstrap()` first, then `setMeAsAdmin()` immediately after, and that both can be done from the same Candid UI",
        "The docs mention where to find the backend canister id in the app (Diagnostics page)"
      ],
      "file_operations": [
        {
          "path": "frontend/PRODUCTION_CONFIGURATION.md",
          "operation": "modify",
          "description": "Extend the Admin/First-Time Admin Setup section to include explicit manual recovery steps via the Candid UI, including the recommended a4gq6… Candid UI URL pattern with `?id=<BACKEND_CANISTER_ID>`, and a strict ordering: call `resetBootstrap()` first, then `setMeAsAdmin()` immediately after (both from the same Candid UI session). Include guidance to obtain `<BACKEND_CANISTER_ID>` from the in-app Diagnostics page (Draft vs Live Diagnostics)."
        },
        {
          "path": "frontend/src/pages/diagnostics/DraftVsLiveDiagnosticsPage.tsx",
          "operation": "modify",
          "description": "Ensure the Diagnostics page clearly displays the backend canister id in a copy-friendly way (already shown, but refine labeling/formatting if needed) so the docs' instructions to find the canister id here are accurate and easy to follow."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Document and validate deployment/smoke-test steps so the live environment can be verified to include the updated /admin recovery UI.",
      "acceptanceCriteria": [
        "A new live deployment is produced that includes the backend `resetBootstrap()` method and the updated /admin UI",
        "Smoke test: user can log in, click Reset Bootstrap, then click Set Me as Admin, and then load the contact submissions admin page without unauthorized errors (for that principal)"
      ],
      "file_operations": [
        {
          "path": "frontend/SMOKE_TEST_PRODUCTION.md",
          "operation": "modify",
          "description": "Add a smoke-test subsection under Access Control Verification for the temporary bootstrap recovery path: authenticated non-admin user can click \"Reset Bootstrap\", see success/failure messaging, then click \"Set Me as Admin\" and subsequently load the submissions admin page without unauthorized errors."
        },
        {
          "path": "frontend/PRODUCTION_DEPLOYMENT_NOTES.md",
          "operation": "modify",
          "description": "Add a short deployment note reminding that after shipping the temporary recovery UI, operators should redeploy and then verify on the live site using the updated smoke test steps, including the /admin recovery flow and /diagnostics/draft-vs-live canister id verification."
        }
      ]
    }
  ]
}