{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Website project with a critical issue: publishing/deploying the current draft to production creates new drafts instead of updating the live site.",
  "architectural_notes": [
    "When user requests publish/go-live, the system must compare current draft vs live, identify deployment blockers, and deploy the exact current draft to production without creating/regenerating new drafts."
  ],
  "known_issues": [
    "Publishing/deploying to live currently creates new draft versions or regenerates draft code; production/live site never updates."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-enhance-the-frontend-backend-health-check-diagnostics-to-retrieve-and-display-the-backend-deployment-identity-information-canister-id-server-timestamp-and-to-log-a-single-clearly-labeled-diagnostic-line-that-helps-detect-draft-live-mismatch-e-g-frontend-host-vs-backend-canister-id",
      "title": "Enhance the frontend backend-health-check diagnostics to retrieve and display the backend deployment identity information (canister ID + server timestamp) and to log a single clearly labeled diagnostic line that helps detect draft/live mismatch (e.g., frontend host vs backend canister ID).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-add-an-in-app-draft-vs-live-verification-diagnostics-view-that-makes-it-obvious-which-environment-a-user-is-currently-viewing-and-whether-the-frontend-is-connected-to-the-expected-backend-show-hostname-build-version-timestamp-backend-canister-id-and-backend-health-status",
      "title": "Add an in-app \"Draft vs Live Verification\" diagnostics view that makes it obvious which environment a user is currently viewing and whether the frontend is connected to the expected backend (show hostname, build version/timestamp, backend canister ID, and backend health status).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-admin-backend-connectivity-diagnostics-ui-to-include-backend-canister-identity-info-when-available-and-provide-more-actionable-troubleshooting-guidance-specifically-for-draft-live-mismatch-and-missing-backend-deployment-scenarios",
      "title": "Update the admin \"Backend Connectivity\" diagnostics UI to include backend canister identity info when available and provide more actionable troubleshooting guidance specifically for draft/live mismatch and missing backend deployment scenarios.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix publish/deploy workflow so the exact current draft is pushed to live/production (no new drafts), including draft-vs-live comparison, blocker identification, and successful zero-downtime deployment when possible.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add a backend query method that returns unambiguous deployment/runtime identity information so the frontend can confirm it is talking to the intended live backend canister (e.g., include the backend canister principal ID and current canister time).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Add draft-vs-live deployment verification diagnostics and canister identity reporting",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}